test_cases/NACA0012-34_FinalSetup_Set1_iddes_alpha-3.625/system/FOsurfaceSample
surface
{
    type            surfaces;
    libs            (sampling);
    writeControl    writeTime;

    surfaceFormat   raw;
    fields          (total(p)_coeff yPlus p rho T);

    // interpolationScheme cellPoint;  //<- default

    surfaces
    {
        airfoil
        {
            type            patch;
            patches         (airfoil);
            interpolate     true;
            invariant       true;  // Unaffected by mesh motion
            surfaceFormat   raw;
        }
    }
}
